# Pandas Library
Pandas was created by Wes McKinney in 2008, and is an open source project under a very permissive license. As an open sourse prroject it's got a strong community, with over one hundred software developers all committing code to help make it better. Before pandas existed we had only hodge podge of tools to use, such as numpy, the python core libraries, and some python statistical tools. But pandas has quickly become the defacto library for representing relational data scientists.
I want to take a moment here to introduce the question answersing site Stack Overflow. Stack Overflow is used brodly within the software development community to post questions about programming, programming languages, and programming toolkits. What's special about Stack Overflow is that it's heavily curated by the community. And the Pandas community, in particular, uses it as their number one resource for helping new members. It's quite possible if you post a question to Stack Overflow, and tag it as being Pandas and Python related, that a core Pandas developer will actually respond to your question. In addition to posting questions, Stack Overflow is a great place to go to see what issues people are havind and how they can be solved. You can learn a lot from browsing Stacks at Stack Overflow and with pandas, this is where the developer community is.
A second resource you might want to consider are books. In 2021 Wes McKinney wrote the definitive Pandas reference book called Python for Data Analysis and published by O'Reilly, and it's recently been update to a second edition. I consider this the go to book for understanding how Pandas works. I also appreciate the more brief book "Learning the Pandas Library" by Matt Harrison. It's not a comprehensive book on data analysis and statistics. But if you just want to learn the basics of Pandas and want to do do quickly, I think it's a well laid out volume and it can be had for a good price.
The field of data science is rapidly changing. There's new toolkits and method being created everyday. It can be tough to say on top of it all. Marco Rodriguez and Tim Golden maintain a wonderful blog aggregator site called Planet Pyhton. Ypu can visit the webpage at planetpython.org, suscribe with an RSS reader, or get the latest articles from the the @PlanetPython Twitter feed. There's lots of regular Python data science contributos, and I highly recommend it if you follow RSS feeds.
## Series 
The series is one of tyhe core data structures in pandas. You think it a cross between a list and a dictionary. The items are all stored in an order and there's labels with which you can retrieve them. An easy way to visualize this is two columns of data. The first is the special index, a lot like keys in a dictionary. While the second is your actual data. It's important to note that the data column has a label of its own and can be retrieved using the name attribute. This is different than with dicitionaries and is useful when it comes to merging multiple columns of data. And we'll talk about that later on in the course

In [1]:
import pandas as pd # Import pandas library
import numpy as np

print(pd.Series(['Alice', 'Jack', 'Molly'])) # Index start in 0 automatically, it will be a object type
print(pd.Series([1, 2, 3])) # Type will be int64 beacuse it is stored using numpy library. 
print(pd.Series(['Alice', 'Jack', None])) # If we have a mnissing data in objects, the type will be object too
print(pd.Series([1, 2, None])) # If we have a missing data in int. the type will be float 64 with special value for None: NaN
print(np.nan == None) # NaN is not the same of None
print(np.nan == np.nan) # NaN is not equal itself
print(np.isnan(np.nan)) # To verifecate if a value es nan we need to use isnan function os numpy library
print(pd.Series({'Alice': 'Physics', 'Jack': 'Chemistry', 'Molly': 'English'})) # If we create a Serie with dictionary, the index will be automatically asign the keys
print(pd.Series([('Alice', 'Brown'), ('Jack', 'White'), ('Molly', 'Green')])) # Serie with more complex data, tuples in this case
print(pd.Series(['Physics', 'Chemistry', 'English'], index = ['Alice', 'Jack', 'Molly']))
print(pd.Series({'Alice': 'Physics', 'Jack': 'Chemistry', 'Molly': 'English'}, index = ['Alice', 'Molly', 'Sam'])) # If we provide index in dictionary, the values which don't have match if fill with nan

0    Alice
1     Jack
2    Molly
dtype: object
0    1
1    2
2    3
dtype: int64
0    Alice
1     Jack
2     None
dtype: object
0    1.0
1    2.0
2    NaN
dtype: float64
False
False
True
Alice      Physics
Jack     Chemistry
Molly      English
dtype: object
0    (Alice, Brown)
1     (Jack, White)
2    (Molly, Green)
dtype: object
Alice      Physics
Jack     Chemistry
Molly      English
dtype: object
Alice    Physics
Molly    English
Sam          NaN
dtype: object

Net we'll talk about one of the primary data types of the Pandas library, the Series. You'll lear about the structure of the Series, how to query and merge Series objects together, and the importance of thinking about parallelization  whe engaging in data science programming.

In [2]:
serie = pd.Series({'Alice': 'Physics', 'Jack': 'Chemistry', 'Molly': 'English', 'Sam': 'History'})
print(serie)
print(serie.iloc[3]) # get the four entry in data set, to search by number of entry we need to use iloc
print(serie.loc['Molly']) # To search by name of entry we need to use loc
# Keep in mind that iloc and loc are not methods, they are attributes. So you don't use parentheses to query them, but square brackets instead, which is called the indexing operator.
# Python try to do more simple and readable the sintaxes and show the value withouth loc and iloc function
print(serie[3])
print(serie['Molly']) # But if the indexes cause confused

Alice      Physics
Jack     Chemistry
Molly      English
Sam        History
dtype: object
History
English
History
English

In [3]:
# If we have two option for select a way to do somenthing in Series is better select which implemented in numpy because it use parallel programing. Lets see a diference
numbers = pd.Series(np.random.randint(0, 1000, 10000))
numbers.head()

0    422
1    833
2    497
3    223
4    230
dtype: int32

In [4]:
%%timeit -n 100
total = 0
for number in numbers:
    total += number
    
total/len(numbers)
#In this example we usea a iterative method

1.5 ms ± 178 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [5]:
%%timeit -n 100
total = np.sum(numbers)
    
total/len(numbers)
#In this example we usea a iterative method
# We can make a mathematics operations in simple way, and it's the better form to do it. Lets see some example

105 µs ± 22.3 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [6]:
%%timeit -n 10
numbers = pd.Series(np.random.randint(0, 1000, 10000))
for label, value in numbers.iteritems():
    numbers.loc[label] = value + 2
# This example use a iterative form

280 ms ± 9.04 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [7]:
%%timeit -n 10
numbers = pd.Series(np.random.randint(0, 1000, 10000))
numbers+=2

248 µs ± 49.1 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [8]:
students_classes = pd.Series({'Alice': 'Physics',
                   'Jack': 'Chemistry',
                   'Molly': 'English',
                   'Sam': 'History'})
print(students_classes)
kelly_classes = pd.Series(['Philosophy', 'Arts', 'Math'], index=['Kelly', 'Kelly', 'Kelly'])
print(kelly_classes)
all_students_classes = pd.concat([students_classes, kelly_classes])
print(all_students_classes)
print(all_students_classes['Kelly'])

Alice      Physics
Jack     Chemistry
Molly      English
Sam        History
dtype: object
Kelly    Philosophy
Kelly          Arts
Kelly          Math
dtype: object
Alice       Physics
Jack      Chemistry
Molly       English
Sam         History
Kelly    Philosophy
Kelly          Arts
Kelly          Math
dtype: object
Kelly    Philosophy
Kelly          Arts
Kelly          Math
dtype: object

## DataFrame
The DataFrame data structure is the heart of the Panda's library. It's a primary object that you'll be working with data analysis and cleaning tasks.
The DataFrame is conceptually a two-dimensional series object, where there's an index and multiple columns of content, with each column havind a label. In fact, the distinction between a column and a row is really onlu a conceptual distinction. And you cand think of the DataFrma itself as sumply a two-axes labeled array.

In [9]:
# We can start with 3 series objects for school records for students and their class grades
record1 = pd.Series({'Name': 'Alice',
                        'Class': 'Physics',
                        'Score': 85})
record2 = pd.Series({'Name': 'Jack',
                        'Class': 'Chemistry',
                        'Score': 82})
record3 = pd.Series({'Name': 'Helen',
                        'Class': 'Biology',
                        'Score': 90})
df = pd.DataFrame([record1, record2, record3], index = ['school1', 'school2', 'school3']) # Create a dataframe with indexes, if we don't include that, the indexes will be automactically as integer numbers
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [10]:
# An alternative form to create a dataframe is with a lisf of dictionaries, each dictionary is a entry of data
students = [{'Name': 'Alice',
              'Class': 'Physics',
              'Score': 85},
            {'Name': 'Jack',
             'Class': 'Chemistry',
             'Score': 82},
            {'Name': 'Helen',
             'Class': 'Biology',
             'Score': 90}]

# Then we pass this list of dictionaries into the DataFrame function
df = pd.DataFrame(students, index=['school1', 'school2', 'school1'])
# And lets print the head again
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [11]:
# In dataFrames we can use loc and iloc in similar way from Series
print(df.iloc[0])
print(df.loc['school2'])
# If we have multiple data for the same label, with loc we can get a dataframe with this data
df.loc['school1']

Name       Alice
Class    Physics
Score         85
Name: school1, dtype: object
Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

          Name    Class  Score
school1  Alice  Physics     85
school1  Helen  Biology     90

In [12]:
# We can access a value with thei two labels
print(df.loc['school1','Name'])
# We can transpose the matrix with T atributte
df.T

school1    Alice
school1    Helen
Name: Name, dtype: object

       school1    school2  school1
Name     Alice       Jack    Helen
Class  Physics  Chemistry  Biology
Score       85         82       90

In [13]:
# However, since iloc and loc are used for row selection, Panda reserves the indexing operator directly on the DataFrame for coumn selection. In a Panda's DataFrame, columns always have a name.
# For this reason the [] operator is only for columns
print(df['Name'])
print(type(df['Name']))
# Make the selections with double indexes is not the better form and it is possible form of error, in special if we are manipulating data. Is better use loc or iloc and send other parameter with name of
# the columns for selection
df.loc[:, ['Name', 'Score']] # Remember in multiple index pandas give you a copy of dataframe instade of view of the dataframe

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object
<class 'pandas.core.series.Series'>

          Name  Score
school1  Alice     85
school2   Jack     82
school1  Helen     90

In [14]:
# For drop we can use this function as a parameter the name of row or column, but it will no delete the original dataframe. For this we need assign true to paramet inplace
df2 = df.copy() # For copy we need assign with this function, in other case it will return the same place of memory and both altered the same data
df2.drop('Name', axis = 1, inplace = True)
del df2['Class'] # With this method we delet directly only a column
df2['ClassRanking'] = None # Finally we can add new data olny with a new index
df2

         Score ClassRanking
school1     85         None
school2     82         None
school1     90         None

## Data Frame Indexing and Loading
In this section we'll be largely using smaller or moderate - sized datasets. A common workflow is to read the dataset in, usually from some external file, then begin to clean and manipulate the dataset for analysis. In this lecture I'm going to demostrate how you can load data from a comma separated file into a DataFrame.

In [15]:
# A comma separated files (csv) is format pretty loose as a format, and incredibly lightweight and totally ubiquitous. 
#!type data\Admission_Predict.csv # Cat command it can be remplaced by type in windows 
df = pd.read_csv('data/Admission_Predict.csv', index_col = 0) # index_col determite the comlumn that we use for index
df.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [16]:
# In order to make more readable columns like SOP and LOR we rename the columns with rename function, for this first we will eliminate white space and rename the comlumns
df.rename(mapper = str.strip, axis = 'columns', inplace = True)
df.rename(columns={'GRE Score':'GRE Score', 'TOEFL Score':'TOEFL Score',
                   'University Rating':'University Rating', 
                   'SOP': 'Statement of Purpose','LOR': 'Letter of Recommendation',
                   'CGPA':'CGPA', 'Research':'Research',
                   'Chance of Admit':'Chance of Admit'}, inplace = True)
df.head()

,GRE Score,TOEFL Score,University Rating,Statement of Purpose,Letter of Recommendation,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [17]:
# We can, for example, assign the values of collumn with this atributte
df.columns = [x.lower() for x in list(df.columns)]
df.head()

,gre score,toefl score,university rating,statement of purpose,letter of recommendation,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

## Querying DataFrame
Inthis section we are going to talk about querying DataFrame. The first step in the process is to understand Boolean masking. Boolean masking is the heart of fast and efficient querying in numpy and pandas, and its analogous to bit masking used in other areas of computational science. By the end of this lecture you'll understand how Boolean masking works, and how to apply this to a DataFrame to get out data you're nterested in.
A boolean mask is an array chich can be of one dimension like a series, or two dimensions like a dataframe, where each of the values in the array are either true or false. This array is essentially overlaid on top of the data structure that we're querying. And any cell aligned with the true value will be admitted into our final result, and any cell aligned with a false value will not.

In [18]:
df = pd.read_csv('data/Admission_Predict.csv', index_col=0)
# And we'll clean up a couple of poorly named columns like we did in a previous lecture
df.columns = [x.lower().strip() for x in df.columns]
# Boolean mask is a values with true or false 
admit_mask = df['chance of admit'] > 0.7
print(admit_mask)
df[admit_mask].head() # In this form we can select only true values

Serial No.
1       True
2       True
3       True
4       True
5      False
       ...
396     True
397     True
398     True
399    False
400     True
Name: chance of admit, Length: 400, dtype: bool

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
6,330,115,5,4.5,3.0,9.34,1,0.90

In [19]:
# We can select in one step
df[df['chance of admit'] > 0.7].head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
6,330,115,5,4.5,3.0,9.34,1,0.90

In [20]:
#If we can make boolean operation for mask, the operator not are 'and, or' it are replaced by '&, |' symbols and is necessary use () for each mask
print((df['chance of admit'] > 0.7) & (df['chance of admit'] < 0.9))
df[(df['chance of admit'] > 0.7) & (df['chance of admit'] < 0.9)].head()

Serial No.
1      False
2       True
3       True
4       True
5      False
       ...
396     True
397     True
398    False
399    False
400    False
Name: chance of admit, Length: 400, dtype: bool

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
7,321,109,3,3.0,4.0,8.20,1,0.75
12,327,111,4,4.0,4.5,9.00,1,0.84

In [21]:
# Other form to create mask is with function greater than (gt) less than (lt) greater or equal than (ge) less or equal than (le)
print(df['chance of admit'].gt(0.7))
df[df['chance of admit'].lt(0.9) & df['chance of admit'].gt(0.7)].head()

Serial No.
1       True
2       True
3       True
4       True
5      False
       ...
396     True
397     True
398     True
399    False
400     True
Name: chance of admit, Length: 400, dtype: bool

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
7,321,109,3,3.0,4.0,8.20,1,0.75
12,327,111,4,4.0,4.5,9.00,1,0.84

In [22]:
df['chance of admit'].gt(0.7) & df['chance of admit'].lt(0.9) == df['chance of admit'].gt(0.7).lt(0.9) # Observe concate gt, lt not equal to and function

Serial No.
1       True
2      False
3      False
4      False
5      False
       ...
396    False
397    False
398     True
399    False
400     True
Name: chance of admit, Length: 400, dtype: bool

## Indexing DataFrame
In this section we've seen, both Series and DataFrames can have indices applied to them. The index is essentially a row level label, and in pandas the rows correspond to axis zero, Indices can either be either autogenerate, such as when we create a dew Series without an index, in whic case we get numeric values, or the can be ser explicity, like when use the dictionary object to creat the seres, or when loaded dat from the CSV file and set appropriate parameters. Another option for setting an index is to use the set_index() function. This function takes a list of columns and promotes those columns to an index. In this lecture we'll explore more about how indexes work in pandas.

In [23]:
df = pd.read_csv("data/Admission_Predict.csv", index_col=0)
# We can change the index with set_index() function as parameter the name of the column for index
df['Serial Number'] = df.index # This is to preserve the values of the serial numbers
df.set_index('Chance of Admit ', inplace = True)
df.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Serial Number
Chance of Admit,,,,,,,,
0.92,337,118,4,4.5,4.5,9.65,1,1
0.76,324,107,4,4.0,4.5,8.87,1,2
0.72,316,104,3,3.0,3.5,8.00,1,3
0.80,322,110,3,3.5,2.5,8.67,1,4
0.65,314,103,2,2.0,3.0,8.21,0,5

In [24]:
# If we need to back to automactic values by Pandas, we use reset_index() function
df.reset_index(inplace = True)
df.head()

,Chance of Admit,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Serial Number
0,0.92,337,118,4,4.5,4.5,9.65,1,1
1,0.76,324,107,4,4.0,4.5,8.87,1,2
2,0.72,316,104,3,3.0,3.5,8.00,1,3
3,0.80,322,110,3,3.5,2.5,8.67,1,4
4,0.65,314,103,2,2.0,3.0,8.21,0,5

One nice feature of Pandas is multi-level indexing. This is similar to composite keys in relational database systems. To create a multi-level indez, we simply call set index and give it a list of columns that we're interested in promoting to an index.
Pandas will search through these in order, finginf the distinct data and form composite indices. A dood exmple of this is often found when dealing with geographical data chich is sorted by regions or demographics. Let's change data sets and look at some census data for a better example. This data is sorted in the file census.csv and comes from the United States Census Bureau. In particular, this is a breakdown of the population level data at the US county level. It's a great example of how different kinds of data sets might be formatted when you're trying to clean them.

In [25]:
df = pd.read_csv('data/census.csv')
df.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
0,40,3,6,1,0,Alabama,Alabama,4779736,4780127,4785161,...,0.002295,-0.193196,0.381066,0.582002,-0.467369,1.030015,0.826644,1.383282,1.724718,0.712594
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861

In [26]:
print(df['SUMLEV'].unique()) # with this function we can see the unique values of this column
df=df[df['SUMLEV'] == 50] # This stept for get only 50 sumlev
columns_to_keep = ['STNAME','CTYNAME','BIRTHS2010','BIRTHS2011','BIRTHS2012','BIRTHS2013',
                   'BIRTHS2014','BIRTHS2015','POPESTIMATE2010','POPESTIMATE2011',
                   'POPESTIMATE2012','POPESTIMATE2013','POPESTIMATE2014','POPESTIMATE2015']
df = df[columns_to_keep] # keep only columns for ubication
df.head()

[40 50]

,STNAME,CTYNAME,BIRTHS2010,BIRTHS2011,BIRTHS2012,BIRTHS2013,BIRTHS2014,BIRTHS2015,POPESTIMATE2010,POPESTIMATE2011,POPESTIMATE2012,POPESTIMATE2013,POPESTIMATE2014,POPESTIMATE2015
1,Alabama,Autauga County,151,636,615,574,623,600,54660,55253,55175,55038,55290,55347
2,Alabama,Baldwin County,517,2187,2092,2160,2186,2240,183193,186659,190396,195126,199713,203709
3,Alabama,Barbour County,70,335,300,283,260,269,27341,27226,27159,26973,26815,26489
4,Alabama,Bibb County,44,266,245,259,247,253,22861,22733,22642,22512,22549,22583
5,Alabama,Blount County,183,744,710,646,618,603,57373,57711,57776,57734,57658,57673

In [27]:
# In this example we can index the dataframe with stanme and ctyname for multilpe-index
df.set_index(['STNAME', 'CTYNAME'], inplace = True)
df.head()

                        BIRTHS2010  BIRTHS2011  BIRTHS2012  BIRTHS2013  \
STNAME  CTYNAME
Alabama Autauga County         151         636         615         574
        Baldwin County         517        2187        2092        2160
        Barbour County          70         335         300         283
        Bibb County             44         266         245         259
        Blount County          183         744         710         646

                        BIRTHS2014  BIRTHS2015  POPESTIMATE2010  \
STNAME  CTYNAME
Alabama Autauga County         623         600            54660
        Baldwin County        2186        2240           183193
        Barbour County         260         269            27341
        Bibb County            247         253            22861
        Blount County          618         603            57373

                        POPESTIMATE2011  POPESTIMATE2012  POPESTIMATE2013  \
STNAME  CTYNAME
Alabama Autauga County            55253            55175            55038
        Baldwin County           186659           190396           195126
        Barbour County            27226            27159            26973
        Bibb County               22733            22642            22512
        Blount County             57711            57776            57734

                        POPESTIMATE2014  POPESTIMATE2015
STNAME  CTYNAME
Alabama Autauga County            55290            55347
        Baldwin County           199713           203709
        Barbour County            26815            26489
        Bibb County               22549            22583
        Blount County             57658            57673

In [28]:
# For query in row data we use loc and iloc to get values and the arguments goes in order
df.loc[[('Michigan', 'Washtenaw County'), ('Michigan', 'Wayne County')],['BIRTHS2010', 'BIRTHS2011']] # In first tuple we give the names of index, and de second value we give the name of columns
# df.loc([1(3)(4)],[2]) 1 is list of index, 2 is list of columns. 3 and 4 are tuples in case of we have multiple indeces

                           BIRTHS2010  BIRTHS2011
STNAME   CTYNAME
Michigan Washtenaw County         977        3826
         Wayne County            5918       23819

In [29]:
# Without [] is a simple number, with one [] is a Serie, with both [] [] is a DataFrame
print(df.loc[('Alabama', 'Bibb County'), 'BIRTHS2011'])
print(type(df.loc[('Alabama', 'Bibb County'), 'BIRTHS2011']))
print(df.loc[('Alabama', 'Bibb County'), ['BIRTHS2011']])
print(type(df.loc[('Alabama', 'Bibb County'), ['BIRTHS2011']]))
print(df.loc[[('Alabama', 'Bibb County')], ['BIRTHS2011']])
print(type(df.loc[[('Alabama', 'Bibb County')], ['BIRTHS2011']]))
df.loc[[('Alabama', 'Bibb County')], ['BIRTHS2011']]

266
<class 'numpy.int64'>
BIRTHS2011    266
Name: (Alabama, Bibb County), dtype: int64
<class 'pandas.core.series.Series'>
                     BIRTHS2011
STNAME  CTYNAME
Alabama Bibb County         266
<class 'pandas.core.frame.DataFrame'>

                     BIRTHS2011
STNAME  CTYNAME
Alabama Bibb County         266

## Missign Values
We've seen a previer of how Pandas handles missing values using the None type and Numpy Nan values. Missing values are pretty common in data cleaning activities. And, missing values can be there for any number of reasons, and I just want to touch on a few here.
For instance, if you are running a survey and a respondant didn't answer a question the missing value is actually an omission. This kind of missing data is called Missing at Random if there are other variables thet might be used to predict the variable which is missing. In my work when I delivery surveys I often find that missing data, say the interest in being involved in a follow up study, often has some correlation with another data field, like gender or ethnicity. If there is no relationship to other variables, then we call this data Missing Completely at Random (MCAR).
These are just two examples of missing data, and there are many more, For instance, data might be missing because it wasn't colletec, either by the process responsible for collecting that data, such as a researcher, or because it wouldn't make sense if it were collected. This last exmple is exremely common when you start joining DataFrames together from multiple sources, such as joining a list of people at a university with a list of offices in the university (studens generally don't have offices).
Let's look at some ways of handling missing data in pandas.

In [30]:
df = pd.read_csv('data/class_grades.csv')
df.head(8) # in this dataframe we has NaN values, we can manipulate this with to forms: drop and fill

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17      NaN     63.15  48.89
3       7         NaN       NaN    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89
5       7       95.00     92.58    93.12     97.78  68.06
6       8       95.05    102.99    56.25     99.07  50.00
7       7       72.85     86.85    60.00       NaN  56.11

In [31]:
df.dropna().head() #This drop Nan values and all data asociated in this rows

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
4       8       91.32     93.64    95.00    107.41  73.89
5       7       95.00     92.58    93.12     97.78  68.06
6       8       95.05    102.99    56.25     99.07  50.00

In [32]:
df.fillna(0).head() # This replace NaN values wita a number, in this case 0

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17     0.00     63.15  48.89
3       7        0.00      0.00    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89

We can use the na_filter option to turn off white space filtering, if white space filtering. If white space is an actual value of interest. But in parctice, this is pretty rare. In data without any NAs, passing na:filter=Flase, can improve the performance of reading a large file. In addition to rules controllling how missing values might be loaded, it's sometimes useful to consider missing values as actually having information. I'll give an example from my own research. I often deal with logs from online learning systems. I've looked at video use in lecture capture systems. In these systems it's common for the player for have a heartbeat functionality where playback statistics are sent to the server every so often, maybe every 30 seconds. These heartbeats can get big as they can carry the whole state of the playback system such as where the video play head is at, where the video size is, which video is being rendered to the screen, how loud the volume is.

In [33]:
df = pd.read_csv("data/log.csv")
df.set_index(['time', 'user'], inplace = True)
df.sort_index(inplace = True)
df.fillna(method = 'ffill').head() # Forward filling, they fill the values that are forward and inserts into it (3th value is missing and fill with 2nd value) Up to down

                           video  playback position  paused  volume
time       user
1469974424 cheryl     intro.html                  5   False    10.0
           sue     advanced.html                 23   False    10.0
1469974454 cheryl     intro.html                  6   False    10.0
           sue     advanced.html                 24   False    10.0
1469974484 cheryl     intro.html                  7   False    10.0

In [34]:
df.fillna(method = 'bfill').head() # Backward fill, they fill the values that are backward and insert into it (21th value is missing and fill with 22th value) Down to up

                           video  playback position paused  volume
time       user
1469974424 cheryl     intro.html                  5  False    10.0
           sue     advanced.html                 23  False    10.0
1469974454 cheryl     intro.html                  6   True     5.0
           sue     advanced.html                 24   True     5.0
1469974484 cheryl     intro.html                  7   True     5.0

In [35]:
# We can also do customized fill-in to replace values with the replace() function. It allows replacement from several approaches: value-to-value, list, dictionary, regex Let's generate a simple example
df = pd.DataFrame({'A': [1, 1, 2, 3, 4],
                   'B': [3, 6, 3, 8, 9],
                   'C': ['a', 'b', 'c', 'd', 'e']})
df

   A  B  C
0  1  3  a
1  1  6  b
2  2  3  c
3  3  8  d
4  4  9  e

In [36]:
df.replace(1, 100) # We can replace 1's with 100, Let's try the value-to-value approach

     A  B  C
0  100  3  a
1  100  6  b
2    2  3  c
3    3  8  d
4    4  9  e

In [37]:
df.replace([1, 3], [100, 300]) #It replace change 1's to 100 and 3's to 300

     A    B  C
0  100  300  a
1  100    6  b
2    2  300  c
3  300    8  d
4    4    9  e

In [38]:
df = pd.read_csv("data/log.csv") # Read again the data set to aplicate replace function
# To replace using a regex we make the first parameter to replace the regex pattern we want to match, the second parameter the value we want to emit upon match, and then we pass in a third parameter 
# 'regex = True'. take a moment to pause this video and think about this problem: Image we want to detect all html pages in the 'video' column, Lets say that just means they end with '.html', and we want
#toaverwrite that with the keyword 'webpage'. How could we accomplish this?
df.replace(to_replace = ".*.html$", value = "webpage", regex = True).head(10)

         time    user    video  playback position paused  volume
0  1469974424  cheryl  webpage                  5  False    10.0
1  1469974454  cheryl  webpage                  6    NaN     NaN
2  1469974544  cheryl  webpage                  9    NaN     NaN
3  1469974574  cheryl  webpage                 10    NaN     NaN
4  1469977514     bob  webpage                  1    NaN     NaN
5  1469977544     bob  webpage                  1    NaN     NaN
6  1469977574     bob  webpage                  1    NaN     NaN
7  1469977604     bob  webpage                  1    NaN     NaN
8  1469974604  cheryl  webpage                 11    NaN     NaN
9  1469974694  cheryl  webpage                 14    NaN     NaN

## Explame of DataFrame
In this lecture I'm going to walk through a basic data cleaning process with you and introduce you to a few more pandas API functions.

In [40]:
df = pd.read_csv("data/presidents.csv")
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days"
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days"
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days"
3,4,James Madison,"Mar 16, 1751[a]","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days"
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days"

In [41]:
df['First'] = df['President'].replace("[ ].*", "", regex = True)
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age,First
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days",George
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days",John
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days",Thomas
3,4,James Madison,"Mar 16, 1751[a]","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days",James
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days",James

In [43]:
del df['First']
df.head(2)

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days"
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days"

In [56]:
def splitname(row):
    row['First'] = row['President'].split(" ")[0]
    row['Last'] = row['President'].split(" ")[-1]
    return row
df = df.apply(splitname, axis = 1)
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age,First,Last
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days",George,Washington
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days",John,Adams
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days",Thomas,Jefferson
3,4,James Madison,"Mar 16, 1751[a]","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days",James,Madison
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days",James,Monroe

In [57]:
del df['First']
del df['Last']
df.head(2)

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days"
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days"

In [73]:
# Extract takes a regular expression as input and secifically requires you to ser capture groups that correspond to the output columns you are interested in.
pattern = "(?P<First>^[\w]+)(?: )(?P<Last>[\w]*$)" # Remember ?: match but not in group
df["President"].str.extract(pattern).head()

    First        Last
0  George  Washington
1    John       Adams
2  Thomas   Jefferson
3   James     Madison
4   James      Monroe

In [74]:
df["Born"]=df["Born"].str.extract("([\w]{3} [\w]{1,2}, [\w]{4})")
df["Born"].head()

0    Feb 22, 1732
1    Oct 30, 1735
2    Apr 13, 1743
3    Mar 16, 1751
4    Apr 28, 1758
Name: Born, dtype: object

In [75]:
df["Born"]=pd.to_datetime(df["Born"])
df["Born"].head()

0   1732-02-22
1   1735-10-30
2   1743-04-13
3   1751-03-16
4   1758-04-28
Name: Born, dtype: datetime64[ns]